jdelaney1251/mod_mem/drivers/qspi_ram/qspi_ram_stm32.c
// #define STM32_QSPI_FIFO_THRESHOLD         1
// #define STM32_QSPI_CLOCK_PRESCALER_MAX  255

// #define INS_READ						0x03
// #define INS_WRITE						0x02
// #define INS_ENTER_SDI					0x3B
// #define INS_ENTER_SQI					0x38
// #define INS_RSTDQI						0xFF
// #define INS_RDMR						0x05
// #define INS_WRMR						0x01					

// #define MODE_REG_BYTE					0x00
// #define MODE_REG_PAGE					0x80
// #define MODE_REG_SEQ					0x40

// #define MODE_SPI						0x00
// #define MODE_SDI						0x01
// #define MODE_SQI						0x02

// typedef void (*irq_config_func_t)(const struct device *dev);

// struct qspi_ram_stm32_config {
//     QUADSPI_TypeDef *regs;
//     struct stm32_pclken pclken;
// 	irq_config_func_t irq_config;
//     uint32_t ram_size;
//     uint32_t max_frequency;
// 	const struct soc_gpio_pinctrl *pinctrl_list;
// 	size_t pinctrl_list_size;
// 	uint8_t dummy_cycles;
// 	uint8_t read_dummy_cycles;
// };

// struct qspi_ram_stm32_data {
//     QSPI_HandleTypeDef hqspi;
// 	struct k_sem sem;
// 	struct k_sem sync;
// 	int cmd_status;
// 	uint8_t access_mode;
// };

// static void qspi_ram_stm32_isr(const struct device *dev)
// {
// 	struct qspi_ram_stm32_data *dev_data = dev->data;

// 	HAL_QSPI_IRQHandler(&dev_data->hqspi);
// }

// __weak HAL_StatusTypeDef HAL_DMA_Abort_IT(DMA_HandleTypeDef *hdma)
// {
// 	return HAL_OK;
// }


// /*
//  * Transfer Error callback.
//  */
// void HAL_QSPI_ErrorCallback(QSPI_HandleTypeDef *hqspi)
// {
// 	struct qspi_ram_stm32_data *dev_data =
// 		CONTAINER_OF(hqspi, struct qspi_ram_stm32_data, hqspi);

// 	LOG_DBG("Error");

// 	dev_data->cmd_status = -EIO;

// 	k_sem_give(&dev_data->sync);
// }

// /*
//  * Command completed callback.
//  */
// void HAL_QSPI_CmdCpltCallback(QSPI_HandleTypeDef *hqspi)
// {
// 	struct qspi_ram_stm32_data *dev_data =
// 		CONTAINER_OF(hqspi, struct qspi_ram_stm32_data, hqspi);

// 	LOG_DBG("Cmd complete");
// 	k_sem_give(&dev_data->sync);
// }

// /*
//  * Rx Transfer completed callback.
//  */
// void HAL_QSPI_RxCpltCallback(QSPI_HandleTypeDef *hqspi)
// {
// 	struct qspi_ram_stm32_data *dev_data =
// 		CONTAINER_OF(hqspi, struct qspi_ram_stm32_data, hqspi);
	
// 	LOG_DBG("Rx complete");
// 	k_sem_give(&dev_data->sync);
// }

// /*
//  * Tx Transfer completed callback.
//  */
// void HAL_QSPI_TxCpltCallback(QSPI_HandleTypeDef *hqspi)
// {
// 	struct qspi_ram_stm32_data *dev_data =
// 		CONTAINER_OF(hqspi, struct qspi_ram_stm32_data, hqspi);

// 		LOG_DBG("Tx complete");
// 	k_sem_give(&dev_data->sync);
// }

// /*
//  * Status Match callback.
//  */
// void HAL_QSPI_StatusMatchCallback(QSPI_HandleTypeDef *hqspi)
// {
// 	struct qspi_ram_stm32_data *dev_data =
// 		CONTAINER_OF(hqspi, struct qspi_ram_stm32_data, hqspi);

// 	LOG_DBG("Status match cb");
// 	k_sem_give(&dev_data->sync);
// }

// /*
//  * Timeout callback.
//  */
// void HAL_QSPI_TimeOutCallback(QSPI_HandleTypeDef *hqspi)
// {
// 	struct qspi_ram_stm32_data *dev_data =
// 		CONTAINER_OF(hqspi, struct qspi_ram_stm32_data, hqspi);

// 	LOG_DBG("Timeout");

// 	dev_data->cmd_status = -EIO;

// 	k_sem_give(&dev_data->sync);
// }

// static int qspi_ram_reset(const struct device *dev)
// {
// 	const struct qspi_ram_stm32_config *dev_cfg = dev->config;
//     struct qspi_ram_stm32_data *dev_data = dev->data;
//     HAL_StatusTypeDef hal_ret;

// 	QSPI_CommandTypeDef cmd = {
//         .Instruction = INS_RSTDQI,
//         .DummyCycles = 0,
//         .InstructionMode = QSPI_INSTRUCTION_4_LINES,
//     };

//     hal_ret = HAL_QSPI_Command_IT(&dev_data->hqspi, &cmd);
// 	if (hal_ret != HAL_OK) {
// 		LOG_ERR("%d: Failed to send QSPI instruction", hal_ret);
// 		return -EIO;
// 	}

// 	cmd.InstructionMode = QSPI_INSTRUCTION_2_LINES;

// 	hal_ret = HAL_QSPI_Command_IT(&dev_data->hqspi, &cmd);
// 	if (hal_ret != HAL_OK) {
// 		LOG_ERR("%d: Failed to send QSPI instruction", hal_ret);
// 		return -EIO;
// 	}
// }

// static int qspi_write(const struct device *dev, QSPI_CommandTypeDef *cmd, uint8_t *data, size_t size)
// {
//     const struct qspi_ram_stm32_config *dev_cfg = dev->config;
//     struct qspi_ram_stm32_data *dev_data = dev->data;
//     HAL_StatusTypeDef hal_ret;

//     cmd->NbData = size;

// 	dev_data->cmd_status = 0;

//     hal_ret = HAL_QSPI_Command_IT(&dev_data->hqspi, cmd);
// 	if (hal_ret != HAL_OK) {
// 		LOG_ERR("%d: Failed to send QSPI instruction", hal_ret);
// 		return -EIO;
// 	}

//     hal_ret = HAL_QSPI_Transmit_IT(&dev_data->hqspi, (uint8_t *)data);

//     if (hal_ret != HAL_OK) {
// 		LOG_ERR("%d: Failed to read data", hal_ret);
// 		return -EIO;
// 	}
// 	LOG_DBG("CCR 0x%x", dev_cfg->regs->CCR);

// 	k_sem_take(&dev_data->sync, K_FOREVER);

// 	return dev_data->cmd_status;
// }

// static int qspi_read(const struct device *dev, QSPI_CommandTypeDef *cmd, uint8_t *data, size_t size)
// {
// 	const struct qspi_ram_stm32_config *dev_cfg = dev->config;
//     struct qspi_ram_stm32_data *dev_data = dev->data;
//     HAL_StatusTypeDef hal_ret;

//     cmd->NbData = size;

// 	dev_data->cmd_status = 0;

//     hal_ret = HAL_QSPI_Command_IT(&dev_data->hqspi, cmd);
// 	if (hal_ret != HAL_OK) {
// 		LOG_ERR("%d: Failed to send QSPI instruction", hal_ret);
// 		return -EIO;
// 	}

//     hal_ret = HAL_QSPI_Receive_IT(&dev_data->hqspi, (uint8_t *)data);

//     if (hal_ret != HAL_OK) {
// 		LOG_ERR("%d: Failed to read data", hal_ret);
// 		return -EIO;
// 	}
// 	LOG_DBG("CCR 0x%x", dev_cfg->regs->CCR);

// 	k_sem_take(&dev_data->sync, K_FOREVER);

// 	return dev_data->cmd_status;
// }

// /*
// 	Internal interface
// */
// static int qspi_ram_send_cmd(const struct device *dev, uint8_t cmd_ins)
// {	
// 	const struct qspi_ram_stm32_config *dev_cfg = dev->config;
//     struct qspi_ram_stm32_data *dev_data = dev->data;
//     HAL_StatusTypeDef hal_ret;

// 	QSPI_CommandTypeDef cmd = {
//         .Instruction = cmd_ins,
//         .DummyCycles = 0,
//         .InstructionMode = QSPI_INSTRUCTION_1_LINE,
//     };

// 	dev_data->cmd_status = 0;
//     hal_ret = HAL_QSPI_Command_IT(&dev_data->hqspi, &cmd);
// 	if (hal_ret != HAL_OK) {
// 		LOG_ERR("%d: Failed to send QSPI instruction", hal_ret);
// 		return -EIO;
// 	}

// 	LOG_DBG("CCR 0x%x", dev_cfg->regs->CCR);

