jdelaney1251/mod_mem/drivers/qspi_ram/qspi_ram_stm32.c
// 	// wait on the tx complete or timeout interrupt
// 	k_sem_take(&dev_data->sync, K_FOREVER);

// 	return dev_data->cmd_status;
// }

// static int qspi_ram_set_mode(const struct device *dev, uint8_t mode)
// {
// 	int ret;

// 	QSPI_CommandTypeDef cmd = {
//         .Instruction = INS_WRMR,
//         .InstructionMode = QSPI_INSTRUCTION_1_LINE,
//         .DataMode = QSPI_DATA_1_LINE,
// 		.NbData = 1,
//     };

// 	ret = qspi_write(dev, &cmd, &mode, 1);
// 	return ret;
// }

// static int qspi_ram_init_mm_mode(const struct device *dev)
// {
// 	const struct qspi_ram_stm32_config *dev_cfg = dev->config;
// 	struct qspi_ram_stm32_data *dev_data = dev->data;
// 	int ret;
// 	QSPI_MemoryMappedTypeDef mmap;

// 	QSPI_CommandTypeDef cmd = {
//         .Instruction = INS_READ,
//         .AddressSize = QSPI_ADDRESS_24_BITS,
// 		.DummyCycles = dev_cfg->read_dummy_cycles,
//         .InstructionMode = QSPI_INSTRUCTION_4_LINES,
//         .AddressMode = QSPI_ADDRESS_4_LINES,
// 		.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE,
//         .DataMode = QSPI_DATA_4_LINES,
// 		.DdrMode = QSPI_DDR_MODE_DISABLE,
// 		.SIOOMode = QSPI_SIOO_INST_EVERY_CMD,
//     };

// 	mmap.TimeOutActivation = QSPI_TIMEOUT_COUNTER_DISABLE;

// 	ret = HAL_QSPI_MemoryMapped(&dev_data->hqspi, &cmd, &mmap);
// 	if (ret != HAL_OK)
// 	{
// 		LOG_ERR("Could not init memory mapped mode");
// 	}
// 	LOG_DBG("hal memmap ret: %d", ret);
// 	return ret;
// }

// /*
// 	Public interface

// */
// static int qspi_ram_stm32_set_access_mode(const struct device *dev, uint8_t mode)
// {
// 	struct qspi_ram_stm32_data *dev_data = dev->data;
// 	int ret;

// 	LOG_DBG("switching access mode");
// 	if ((dev_data->access_mode == QSPI_RAM_MODE_INDIRECT) && (mode == QSPI_RAM_MODE_MEM_MAPPED))
// 	{
// 		LOG_DBG("switching to mem mapped mode");
// 		ret = qspi_ram_init_mm_mode(dev);

// 	}
// 	else if ((dev_data->access_mode == QSPI_RAM_MODE_MEM_MAPPED) && (mode == QSPI_RAM_MODE_INDIRECT))
// 	{
// 		// clear busy bit and send any command to get out of mem mapped mode
// 		HAL_QSPI_Abort_IT(&dev_data->hqspi);
// 		ret = qspi_ram_send_cmd(dev, INS_ENTER_SQI);
// 	}
// 	else
// 	{
// 		return -1;
// 	}
// 	return ret;
// }

// static int qspi_ram_stm32_write_mem_addr(const struct device *dev, uint32_t addr, uint8_t data)
// {
// 	int ret; 

// 	QSPI_CommandTypeDef cmd = {
//         .Instruction = INS_WRITE,
//         .AddressSize = QSPI_ADDRESS_24_BITS,
// 		.Address = addr,
//         .DummyCycles = 0,
//         .InstructionMode = QSPI_INSTRUCTION_4_LINES,
//         .AddressMode = QSPI_ADDRESS_4_LINES,
// 		.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE,
//         .DataMode = QSPI_DATA_4_LINES,
// 		.NbData = 1,
//     };

// 	ret = qspi_write(dev, &cmd, &data, 1);
//     return ret;
// }

// static int qspi_ram_stm32_read_mem_addr(const struct device *dev, uint32_t addr, uint8_t *data)
// {
// 	const struct qspi_ram_stm32_config *dev_cfg = dev->config;
// 	int ret;
	
// 	QSPI_CommandTypeDef cmd = {
//         .Instruction = INS_READ,
//         .AddressSize = QSPI_ADDRESS_24_BITS,
// 		.Address = addr,
// 		.DummyCycles = dev_cfg->read_dummy_cycles,
//         .InstructionMode = QSPI_INSTRUCTION_4_LINES,
//         .AddressMode = QSPI_ADDRESS_4_LINES,
// 		.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE,
//         .DataMode = QSPI_DATA_4_LINES,
// 		.NbData = 1,
//     };	
	
// 	ret = qspi_read(dev, &cmd, data, 1);
//     return ret;
// }

// static int qspi_ram_stm32_write_mem_range(const struct device *dev)
// {
//     return 0;
// }

// static int qspi_ram_stm32_read_mem_range(const struct device *dev)
// {
//     return 0;
// }

// static const struct qspi_ram_driver_api qspi_ram_stm32_driver_api = {
// 	.set_access_mode = qspi_ram_stm32_set_access_mode,
//     .write_mem_addr = qspi_ram_stm32_write_mem_addr,
//     .read_mem_addr = qspi_ram_stm32_read_mem_addr,
//     .write_mem_range = qspi_ram_stm32_write_mem_range,
//     .read_mem_range = qspi_ram_stm32_read_mem_range,
// };


// static int qspi_ram_stm32_init(const struct device *dev)
// {
//     const struct qspi_ram_stm32_config *dev_cfg = dev->config;
//     struct qspi_ram_stm32_data *dev_data = dev->data;
//     uint32_t ahb_clock_freq;
//     uint32_t prescaler = 0;
//     int ret;

//     ret = stm32_dt_pinctrl_configure(dev_cfg->pinctrl_list, dev_cfg->pinctrl_list_size, (uint32_t)dev_cfg->regs);
//     if (ret < 0)
//     {
//         LOG_ERR("QSPI pinctrl setup failed (%d)", ret);
//         return ret;
//     }

//     /* Clock configuration */
// 	if (clock_control_on(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
// 			     (clock_control_subsys_t) &dev_cfg->pclken) != 0) {
// 		LOG_DBG("Could not enable QSPI clock");
// 		return -EIO;
// 	}

// 	if (clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
// 			(clock_control_subsys_t) &dev_cfg->pclken,
// 			&ahb_clock_freq) < 0) {
// 		LOG_DBG("Failed to get AHB clock frequency");
// 		return -EIO;
// 	}

// 	for (; prescaler <= STM32_QSPI_CLOCK_PRESCALER_MAX; prescaler++) {
// 		uint32_t clk = ahb_clock_freq / (prescaler + 1);

// 		if (clk <= dev_cfg->max_frequency) {
// 			break;
// 		}
// 	}
// 	__ASSERT_NO_MSG(prescaler <= STM32_QSPI_CLOCK_PRESCALER_MAX);
// 	/* Initialize QSPI HAL */
// 	dev_data->hqspi.Init.ClockPrescaler = prescaler;
// 	dev_data->hqspi.Init.FlashSize = find_lsb_set(dev_cfg->ram_size);

// 	LOG_DBG("prescaler %d", prescaler);

// 	ret = HAL_QSPI_Init(&dev_data->hqspi);
// 	LOG_DBG("HAL QSPI init ret: %d", ret);

// 	k_sem_init(&dev_data->sem, 1, 1);
// 	k_sem_init(&dev_data->sync, 0, 1);

// 	dev_cfg->irq_config(dev);

// 	ret = qspi_ram_reset(dev);

// 	// put QSPI RAM in sequential address mode
// 	ret = qspi_ram_set_mode(dev, MODE_REG_SEQ);

// 	// enter QUAD data mode
// 	ret = qspi_ram_send_cmd(dev, INS_ENTER_SQI);

// 	dev_data->access_mode = QSPI_RAM_MODE_INDIRECT;

// 	LOG_INF("Init completed");
//     return 0;
// }

// static void qspi_ram_stm32_irq_config_func(const struct device *dev);

// static const struct soc_gpio_pinctrl qspi_pins[] =
// 					ST_STM32_DT_PINCTRL(quadspi, 0);

// #define STM32_QSPI_NODE DT_PARENT(DT_DRV_INST(0))

// static const struct qspi_ram_stm32_config qspi_ram_stm32_cfg = {
// 	.regs = (QUADSPI_TypeDef *)DT_REG_ADDR(STM32_QSPI_NODE),
// 	.pclken = {
// 		.enr = DT_CLOCKS_CELL(STM32_QSPI_NODE, bits),
// 		.bus = DT_CLOCKS_CELL(STM32_QSPI_NODE, bus)
// 	},
// 	.irq_config = qspi_ram_stm32_irq_config_func,
// 	.ram_size = DT_INST_PROP(0, size) / 8U,
// 	.max_frequency = DT_INST_PROP(0, qspi_max_frequency),
// 	.pinctrl_list = qspi_pins,
// 	.pinctrl_list_size = ARRAY_SIZE(qspi_pins),
// 	.dummy_cycles = 0,
// 	.read_dummy_cycles = DT_INST_PROP(0, data_lines) / 2
// };

// static struct qspi_ram_stm32_data qspi_ram_stm32_dev_data = {
// 	.hqspi = {
// 		.Instance = (QUADSPI_TypeDef *)DT_REG_ADDR(STM32_QSPI_NODE),
// 		.Init = {
// 			.FifoThreshold = STM32_QSPI_FIFO_THRESHOLD,
// 			.SampleShifting = QSPI_SAMPLE_SHIFTING_NONE,
// 			.ChipSelectHighTime = QSPI_CS_HIGH_TIME_1_CYCLE,
// 			.ClockMode = QSPI_CLOCK_MODE_0,
// 			},
// 	},
// };

// DEVICE_DT_INST_DEFINE(0, &qspi_ram_stm32_init, NULL,
// 		      &qspi_ram_stm32_dev_data, &qspi_ram_stm32_cfg,
// 		      POST_KERNEL, CONFIG_KERNEL_INIT_PRIORITY_DEVICE,
// 		      &qspi_ram_stm32_driver_api);

// static void qspi_ram_stm32_irq_config_func(const struct device *dev)
// {
// 	IRQ_CONNECT(DT_IRQN(STM32_QSPI_NODE), DT_IRQ(STM32_QSPI_NODE, priority),
// 		    qspi_ram_stm32_isr, DEVICE_DT_INST_GET(0), 0);
// 	irq_enable(DT_IRQN(STM32_QSPI_NODE));
// }